-module(buffInformation).
-export([get_data/1,get_indexs/0]).
get_data(1000) -> {buffInformation,1000,0,0,<<"0">>,0,<<"天生扣将">>,<<"增加扣篮权值以及扣篮值100%">>,0,1,1,0,0,0,0};
get_data(1001) -> {buffInformation,1001,0,0,<<"0">>,0,<<"强心剂">>,<<"增加外攻、内攻100%">>,0,1,1,1,0,0,0};
get_data(1002) -> {buffInformation,1002,1,0,<<"0">>,0,<<"金刚不坏">>,<<"增加一层护盾">>,0,1,1,0,0,0,0};
get_data(1003) -> {buffInformation,1003,0,0,<<"0">>,0,<<"精力充沛">>,<<"攻击力提升100%">>,0,1,1,0,0,0,0};
get_data(1004) -> {buffInformation,1004,0,0,<<"0">>,0,<<"软饭王">>,<<"增加10%的所有属性">>,0,99,1,0,0,0,0};
get_data(1005) -> {buffInformation,1005,0,0,<<"0">>,0,<<"顽强的防御者">>,<<"免疫防御属性下降">>,0,1,1,0,0,0,0};
get_data(1006) -> {buffInformation,1006,0,0,<<"0">>,0,<<"铁壁防御">>,<<"增加外防、内防100%">>,0,1,1,1,0,0,0};
get_data(1007) -> {buffInformation,1007,0,0,<<"0">>,0,<<"团队领袖">>,<<"增加投篮值50%">>,0,1,1,0,0,0,0};
get_data(1008) -> {buffInformation,1008,0,0,<<"0">>,0,<<"稳定得分">>,<<"增加投篮值30%">>,0,99,1,0,0,0,0};
get_data(1009) -> {buffInformation,1009,0,0,<<"0">>,0,<<"巨鹰的进击">>,<<"增加所有属性100%">>,0,1,1,1,0,0,0};
get_data(1010) -> {buffInformation,1010,0,0,<<"0">>,0,<<"我的后宫">>,<<"每秒增加3点HP">>,0,99,1,1,0,1,0};
get_data(1011) -> {buffInformation,1011,0,0,<<"0">>,0,<<"势不可挡2分">>,<<"增加所有属性20%">>,0,99,1,0,0,0,0};
get_data(1012) -> {buffInformation,1012,0,0,<<"0">>,0,<<"势不可挡3分">>,<<"增加所有属性30%">>,0,99,1,0,0,0,0};
get_data(1013) -> {buffInformation,1013,0,0,<<"0">>,0,<<"表演时刻">>,<<"增加外攻100%、提供进攻核心概率">>,0,1,1,1,0,0,0};
get_data(1014) -> {buffInformation,1014,0,0,<<"0">>,0,<<"冰人的领域">>,<<"增加外攻100%">>,0,99,1,0,0,0,0};
get_data(1015) -> {buffInformation,1015,0,0,<<"0">>,0,<<"晨间占卜">>,<<"增加外攻100%">>,0,1,1,0,0,0,0};
get_data(1016) -> {buffInformation,1016,0,0,<<"0">>,0,<<"弱点搜查">>,<<"增加抢断30%">>,0,99,1,0,0,0,0};
get_data(1017) -> {buffInformation,1017,0,0,<<"0">>,0,<<"大搜捕">>,<<"增加外防、内防50%">>,0,1,1,1,0,0,0};
get_data(1018) -> {buffInformation,1018,1,0,<<"0">>,3,<<"宁静止水">>,<<"增加一层护盾">>,0,1,1,0,0,0,0};
get_data(1019) -> {buffInformation,1019,0,0,<<"0">>,3,<<"强化">>,<<"增加所有属性50%">>,0,1,1,0,0,0,0};
get_data(1020) -> {buffInformation,1020,0,0,<<"0">>,0,<<"金刚不坏">>,<<"HP回复速度为2倍">>,0,1,1,0,0,0,0};
get_data(1021) -> {buffInformation,1021,0,0,<<"0">>,3,<<"攻守平衡">>,<<"增加攻击力、防御力50%">>,20,1,1,0,0,0,0};
get_data(1022) -> {buffInformation,1022,1,0,<<"0">>,3,<<"激励">>,<<"增加一层护盾">>,0,1,1,0,0,0,0};
get_data(1023) -> {buffInformation,1023,3,0,<<"0">>,3,<<"突破小成功">>,<<"增加投篮、扣篮命中率20%">>,2,1,1,0,0,0,0};
get_data(1024) -> {buffInformation,1024,3,0,<<"0">>,3,<<"突破中成功">>,<<"增加投篮、扣篮命中率40%">>,3,1,1,0,0,0,0};
get_data(1025) -> {buffInformation,1025,3,0,<<"0">>,3,<<"突破大成功">>,<<"增加投篮、扣篮命中率60%">>,5,1,1,0,0,0,0};
get_data(1026) -> {buffInformation,1026,0,0,<<"0">>,3,<<"强心剂（新）">>,<<"增加攻击力100%">>,10,1,1,0,0,0,0};
get_data(1027) -> {buffInformation,1027,0,0,<<"0">>,3,<<"弱点搜查（新）">>,<<"掏球时减少的offensePoint翻倍">>,20,1,1,0,0,0,0};
get_data(2000) -> {buffInformation,2000,2,0,<<"0">>,0,<<"八相阵">>,<<"进攻核心概率为0，无法使用技能">>,0,1,0,1,0,0,1};
get_data(2001) -> {buffInformation,2001,0,0,<<"0">>,0,<<"20000女人斩">>,<<"降低所有属性20%">>,0,1,0,0,0,0,0};
get_data(2002) -> {buffInformation,2002,0,0,<<"0">>,0,<<"软饭王">>,<<"降低10%的所有属性">>,0,99,0,0,0,0,0};
get_data(2003) -> {buffInformation,2003,0,0,<<"0">>,0,<<"我的后宫">>,<<"每秒减少3点HP">>,0,1,0,1,0,1,0};
get_data(2004) -> {buffInformation,2004,2,0,<<"0">>,0,<<"摇手指">>,<<"攻击力降低50%">>,20,1,0,0,0,0,1};
get_data(2005) -> {buffInformation,2005,2,0,<<"0">>,0,<<"冰人">>,<<"进攻核心概率为0，无法使用技能">>,0,1,0,1,0,0,1};
get_data(2006) -> {buffInformation,2006,0,0,<<"0">>,0,<<"绝对零度">>,<<"队伍能量无法增长">>,20,1,0,1,0,0,0};
get_data(2007) -> {buffInformation,2007,2,0,<<"0">>,0,<<"强心剂的DEBUFF">>,<<"队伍能量无法增长">>,15,1,0,0,0,0,0};
get_data(2008) -> {buffInformation,2008,0,0,<<"0">>,0,<<"刺客之道">>,<<"每秒减少10点HP">>,10,1,0,0,0,1,0};
get_data(2009) -> {buffInformation,2009,0,0,<<"0">>,0,<<"手铐逮捕">>,<<"衰竭、HP无法增长">>,30,1,0,0,0,0,0};
get_data(2010) -> {buffInformation,2010,0,0,<<"0">>,2,<<"冻结">>,<<"队伍能量无法增长">>,20,1,0,0,0,0,0};
get_data(2011) -> {buffInformation,2011,0,0,<<"0">>,2,<<"衰竭">>,<<"所有属性降低至50%">>,0,1,0,0,0,0,0};
get_data(2012) -> {buffInformation,2012,0,0,<<"0">>,2,<<"衰竭-脚踝终结">>,<<"所有属性降低至50%">>,20,1,0,0,0,0,0};
get_data(2013) -> {buffInformation,2013,0,0,<<"0">>,0,<<"盖帽弱化">>,<<"降低50%盖帽值">>,3,1,0,0,0,0,0};


get_data(_Id) -> [].
get_indexs() -> [1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015,1016,1017,1018,1019,1020,1021,1022,1023,1024,1025,1026,1027,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013].
