-module(itemBaseInfo).
-export([get_data/1,get_indexs/0]).
get_data(10000) -> {itemBaseInfo,10000,<<"icon_01">>,1,<<"新奥尔良烤翅">>,<<"热乎乎刚出炉的鸡翅">>,<<"新手级赏金赛">>,<<"0">>,100};
get_data(10001) -> {itemBaseInfo,10001,<<"icon_02">>,1,<<"丹佛">>,<<"好大一块金子啊">>,<<"新手级赏金赛">>,<<"0">>,100};
get_data(10002) -> {itemBaseInfo,10002,<<"icon_03">>,1,<<"奥兰多">>,<<"这是一根神奇的魔术棒">>,<<"新手级赏金赛">>,<<"0">>,100};
get_data(10003) -> {itemBaseInfo,10003,<<"icon_04">>,1,<<"印第安纳">>,<<"元素之力会毁灭你">>,<<"新手级赏金赛">>,<<"0">>,100};
get_data(10004) -> {itemBaseInfo,10004,<<"icon_05">>,1,<<"犹他">>,<<"盐湖城里有好多盐">>,<<"新手级赏金赛">>,<<"0">>,100};
get_data(10005) -> {itemBaseInfo,10005,<<"icon_06">>,1,<<"克利夫兰">>,<<"我有一把骑士剑">>,<<"进阶级赏金赛">>,<<"0">>,100};
get_data(10006) -> {itemBaseInfo,10006,<<"icon_07">>,1,<<"亚特兰大">>,<<"老鹰抓小鸡">>,<<"进阶级赏金赛">>,<<"0">>,100};
get_data(10007) -> {itemBaseInfo,10007,<<"icon_08">>,1,<<"菲尼克斯">>,<<"凤凰可不是鸡变的">>,<<"进阶级赏金赛">>,<<"0">>,100};
get_data(10008) -> {itemBaseInfo,10008,<<"icon_01">>,1,<<"夏洛特">>,<<"我只知道魔兽里的影子山猫">>,<<"进阶级赏金赛">>,<<"0">>,100};
get_data(10009) -> {itemBaseInfo,10009,<<"icon_02">>,1,<<"多伦多">>,<<"恐龙时代来临了">>,<<"进阶级赏金赛">>,<<"0">>,100};
get_data(10010) -> {itemBaseInfo,10010,<<"icon_03">>,1,<<"雷霆">>,<<"雷神之锤">>,<<"精英级赏金赛">>,<<"0">>,100};
get_data(10011) -> {itemBaseInfo,10011,<<"icon_04">>,1,<<"达拉斯">>,<<"不用麻烦了，牛仔很忙的">>,<<"精英级赏金赛">>,<<"0">>,100};
get_data(10012) -> {itemBaseInfo,10012,<<"icon_05">>,1,<<"纽约">>,<<"纽约人民欢迎你">>,<<"精英级赏金赛">>,<<"0">>,100};
get_data(10013) -> {itemBaseInfo,10013,<<"icon_06">>,1,<<"休斯顿">>,<<"航天城里有姚明">>,<<"精英级赏金赛">>,<<"0">>,100};
get_data(10014) -> {itemBaseInfo,10014,<<"icon_07">>,1,<<"底特律">>,<<"汽车城已经破产了">>,<<"精英级赏金赛">>,<<"0">>,100};
get_data(10015) -> {itemBaseInfo,10015,<<"icon_08">>,1,<<"迈阿密">>,<<"为什么这里这么热">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(10016) -> {itemBaseInfo,10016,<<"icon_01">>,1,<<"圣安东尼奥">>,<<"马刺这种东西从没见过">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(10017) -> {itemBaseInfo,10017,<<"icon_02">>,1,<<"芝加哥">>,<<"一只公牛没有角">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(10018) -> {itemBaseInfo,10018,<<"icon_03">>,1,<<"洛杉鸡">>,<<"洛杉矶是一只巨大的鸡">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(10019) -> {itemBaseInfo,10019,<<"icon_04">>,1,<<"波士顿">>,<<"这盾牌能抗住BOSS么">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20000) -> {itemBaseInfo,20000,<<"icon_05">>,2,<<"郑容和碎片">>,<<"用来合成更厉害的郑容和">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20001) -> {itemBaseInfo,20001,<<"icon_06">>,2,<<"马里奥碎片">>,<<"用来合成更厉害的马里奥">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20002) -> {itemBaseInfo,20002,<<"icon_07">>,2,<<"酋长碎片">>,<<"用来合成更厉害的酋长">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20003) -> {itemBaseInfo,20003,<<"icon_08">>,2,<<"鹿晗碎片">>,<<"用来合成更厉害的鹿晗">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20004) -> {itemBaseInfo,20004,<<"icon_01">>,2,<<"艾吉奥碎片">>,<<"用来合成更厉害的艾吉奥">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20005) -> {itemBaseInfo,20005,<<"icon_02">>,2,<<"毒药碎片">>,<<"用来合成更厉害的毒药">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20006) -> {itemBaseInfo,20006,<<"icon_03">>,2,<<"古烈碎片">>,<<"用来合成更厉害的古烈">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20007) -> {itemBaseInfo,20007,<<"icon_04">>,2,<<"少林碎片">>,<<"用来合成更厉害的少林">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20008) -> {itemBaseInfo,20008,<<"icon_05">>,2,<<"冰人碎片">>,<<"用来合成更厉害的冰人">>,<<"大师级赏金赛">>,<<"0">>,100};
get_data(20009) -> {itemBaseInfo,20009,<<"icon_06">>,2,<<"福尔摩斯碎片">>,<<"用来合成更厉害的福尔摩斯">>,<<"大师级赏金赛">>,<<"0">>,100};


get_data(_Id) -> [].
get_indexs() -> [10000,10001,10002,10003,10004,10005,10006,10007,10008,10009,10010,10011,10012,10013,10014,10015,10016,10017,10018,10019,20000,20001,20002,20003,20004,20005,20006,20007,20008,20009].
