-module(playerPositionAIInfo).
-export([get_data/1,get_indexs/0]).
get_data(1000) -> {playerPositionAIInfo,1000,1000,<<"郑容和">>,60,8,8,8,8,8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
get_data(1001) -> {playerPositionAIInfo,1001,1001,<<"马里奥">>,60,8,8,8,8,8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
get_data(1002) -> {playerPositionAIInfo,1002,1002,<<"酋长">>,0,5,5,5,5,5,10,10,10,10,10,5,5,5,5,5,0,0,0,0,0};
get_data(1003) -> {playerPositionAIInfo,1003,1003,<<"鹿晗">>,0,5,5,5,5,5,10,10,10,10,10,5,5,5,5,5,0,0,0,0,0};
get_data(1004) -> {playerPositionAIInfo,1004,1004,<<"艾吉奥">>,0,0,0,0,0,0,0,0,0,0,0,10,10,10,10,10,10,10,10,10,10};
get_data(1005) -> {playerPositionAIInfo,1005,1005,<<"毒药">>,0,0,0,0,0,0,0,0,0,0,0,10,10,10,10,10,10,10,10,10,10};
get_data(1006) -> {playerPositionAIInfo,1006,1006,<<"古烈">>,60,8,8,8,8,8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
get_data(1007) -> {playerPositionAIInfo,1007,1007,<<"少林">>,10,12,12,12,12,12,6,6,6,6,6,0,0,0,0,0,0,0,0,0,0};
get_data(1008) -> {playerPositionAIInfo,1008,1008,<<"冰人">>,0,0,0,0,0,0,8,8,8,8,8,8,8,8,8,8,4,4,4,4,4};
get_data(1009) -> {playerPositionAIInfo,1009,1009,<<"福尔摩斯">>,0,0,0,0,0,0,8,8,8,8,8,8,8,8,8,8,4,4,4,4,4};


get_data(_Id) -> [].
get_indexs() -> [1000,1001,1002,1003,1004,1005,1006,1007,1008,1009].
