-module(skillInfo).
-export([get_data/1,get_indexs/0]).
get_data(2000) -> {skillInfo,2000,2000,<<"脚踝终结者">>,<<"使用后下一次本方进攻将由技能释放者持球，对对位防守球员使用华丽的突破技巧。">>,<<"Skill_JiaoHuaiZhongJieZhe">>,1,2,1,4,1,10,0,20};
get_data(2001) -> {skillInfo,2001,2001,<<"无规则射篮">>,<<"使用后下一次本方进攻将由技能释放者持球，使用一次无规则射篮，无视对方除技能外的盖帽。">>,<<"Skill_WuGuiZeSheLan">>,1,2,1,1,1,10,0,50};
get_data(2002) -> {skillInfo,2002,2002,<<"破城巨锤">>,<<"使用后下一次本方进攻将由技能释放者持球，进行一次强力的灌篮。成功后增加少量能量。">>,<<"Skill_PoChengJuChui">>,1,2,1,3,1,10,0,50};
get_data(2003) -> {skillInfo,2003,2003,<<"猛虎之爪">>,<<"使用后下一次篮板球时技能释放者将使用Vise Claw，有极高概率直接获得篮板球。">>,<<"Skill_MengHuZhiZhua">>,7,2,3,8,8,10,0,30};
get_data(2004) -> {skillInfo,2004,2004,<<"背刺截断">>,<<"使用后，选择一个非对位球员。立刻对其发动一次抢断。">>,<<"Skill_BeiCiJieDuan">>,4,2,2,9,2,10,0,30};
get_data(2005) -> {skillInfo,2005,2005,<<"急速冷却">>,<<"对方能量无法增长，持续30秒。">>,<<"Skill_JiSuLengQue">>,7,2,2,10,0,10,0,50};
get_data(2006) -> {skillInfo,2006,2006,<<"宁静止水">>,<<"为自己增加一层“免疫”效果。">>,<<"Skill_NingJingZhiShui">>,7,2,0,0,0,10,0,50};
get_data(2007) -> {skillInfo,2007,2007,<<"手铐逮捕">>,<<"使得对方一名球员陷入“衰竭”状态，且HP无法增长，持续30秒。">>,<<"Skill_ShouKaoDaiBu">>,7,2,3,11,0,10,1,50};
get_data(2008) -> {skillInfo,2008,2008,<<"梦幻舞步">>,<<"使用后，利用一连串的假动作连续过人后实施投篮。">>,<<"Skill_MengHuanWuBu">>,1,2,1,4,1,10,0,20};
get_data(2009) -> {skillInfo,2009,2009,<<"鹰之眼">>,<<"以一次漂亮的传球，助攻己方球员扣篮得分。">>,<<"Skill_YingZhiYan">>,1,2,1,5,1,10,0,50};
get_data(2010) -> {skillInfo,2010,2010,<<"黑子传球">>,<<"通过队友的快速传递进行空中接力。">>,<<"Skill_HeiZiChuanQiu">>,1,2,1,5,1,10,0,50};
get_data(2011) -> {skillInfo,2011,2011,<<"身后盖帽">>,<<"若对方使用投篮型主动技则一定概率触发，对对方进行盖帽，抵消对方技能。">>,<<"Skill_ShenHouGaiMao">>,6,3,2,7,4,10,0,50};
get_data(2012) -> {skillInfo,2012,2012,<<"激励">>,<<"使得本队所有球员回复所有HP，并且获得一个护盾。">>,<<"Skill_JiLi">>,7,2,0,0,0,10,0,30};
get_data(3000) -> {skillInfo,3000,3000,<<"空切进攻">>,<<"己方使用攻击型主动技则一定概率触发，可以在技能对抗结束前改为另外一名球员持球进攻。">>,<<"Skill_KongQieJinGong">>,2,3,1,5,6,10,0,50};
get_data(3002) -> {skillInfo,3002,3002,<<"拦截者">>,<<"若对方使用传球型技能时触发，一定概率造成抢断。">>,<<"Skill_LanJieZhe">>,6,3,2,9,5,10,0,50};
get_data(3004) -> {skillInfo,3004,3004,<<"飞空行者">>,<<"脚踝终结者释放成功后可以释放。进行一次华丽的上篮。">>,<<"Skill_FeiKongXingZhe">>,1,3,1,1,7,10,0,50};
get_data(4000) -> {skillInfo,4000,4000,<<"天生扣将">>,<<"增加扣篮的触发几率及命中率。">>,<<"Skill_TianShenKouJiang">>,0,4,0,0,0,0,0,0};
get_data(4001) -> {skillInfo,4001,4001,<<"激励得分手">>,<<"每次得分会为本队少量增加队伍能量。">>,<<"Skill_JiLiDeFenShou">>,0,4,0,0,0,0,0,0};
get_data(4002) -> {skillInfo,4002,4002,<<"强心剂">>,<<"激励：在激励持续时间内增加己方所有球员外攻及内攻属性100%。">>,<<"Skill_QiangXinJi">>,0,4,0,0,0,0,0,100};
get_data(4003) -> {skillInfo,4003,4003,<<"金刚不坏">>,<<"体力衰竭状态下，体力回复速率为2倍。">>,<<"Skill_JinGangBuHuai">>,0,4,0,0,0,0,0,0};
get_data(4004) -> {skillInfo,4004,4004,<<"精力充沛">>,<<"当HP为满时，自身的内线攻击及力量属性提升100%。">>,<<"Skill_JingLiChongPei">>,0,4,0,0,0,0,0,0};
get_data(4005) -> {skillInfo,4005,4005,<<"八相阵">>,<<"激励：冻结你的对位球员。持续整个士气高涨阶段。">>,<<"Skill_BaXiangZhen">>,0,4,0,0,0,0,0,100};
get_data(4006) -> {skillInfo,4006,4006,<<"20000号女性杂志">>,<<"这名球员非常受女性欢迎，以至于所有女性无法专心打球，降低所有女性全属性20%。">>,<<"Skill_NvXingZaZhi">>,0,4,0,0,0,0,0,0};
get_data(4007) -> {skillInfo,4007,4007,<<"软饭王">>,<<"每次得分将吸取对位对手10%的所有属性，持续整场比赛。">>,<<"Skill_RuanFanWang">>,0,4,0,0,0,0,0,0};
get_data(4008) -> {skillInfo,4008,4008,<<"我的后宫">>,<<"激励：激励持续时间内，持续吸取对方所有女性球员的HP，每秒3点。">>,<<"Skill_WoDeHouGong">>,0,4,0,0,0,0,0,100};
get_data(4009) -> {skillInfo,4009,4009,<<"摇手指">>,<<"若触发盖帽，则\"冻结“被盖帽的球员。持续到敌方队伍的下一次进攻结束。">>,<<"Skill_YaoShouZhi">>,0,4,0,0,0,0,0,0};
get_data(4010) -> {skillInfo,4010,4010,<<"顽强的防御者">>,<<"自身的防御属性无法下降。">>,<<"Skill_WanQiangDeFangYuZhe">>,0,4,0,0,0,0,0,0};
get_data(4011) -> {skillInfo,4011,4011,<<"铁壁防御">>,<<"激励：在激励持续时间内增加己方所有球员外防及内防属性100%。">>,<<"Skill_TieBiFangYu">>,0,4,0,0,0,0,0,100};
get_data(4012) -> {skillInfo,4012,4012,<<"团队领袖">>,<<"增加本队所有球员投篮值50%。">>,<<"Skill_TuanDuiLingXiu">>,0,4,0,0,0,0,0,0};
get_data(4013) -> {skillInfo,4013,4013,<<"稳定得分">>,<<"每10秒增加自身所有投篮属性30%，持续到一次得分为止。">>,<<"Skill_WenDingDeFen">>,0,4,0,0,0,0,0,0};
get_data(4014) -> {skillInfo,4014,4014,<<"巨鹰的进击">>,<<"激励：持续时间内增加本队所有球员所有属性100%。">>,<<"Skill_JuYingDeJinJi">>,0,4,0,0,0,0,0,100};
get_data(4015) -> {skillInfo,4015,4015,<<"闪亮登场">>,<<"比赛开始时，增加己方队伍能量20点。">>,<<"Skill_ShanLiangDengChang">>,0,4,0,0,0,0,0,0};
get_data(4016) -> {skillInfo,4016,4016,<<"势不可挡">>,<<"每得N分，提升所有属性(10*N)%。">>,<<"Skill_ShiBuKeDang">>,0,4,0,0,0,0,0,0};
get_data(4017) -> {skillInfo,4017,4017,<<"表演时刻">>,<<"激励：增加自身100%外线进攻，激励效果内将完全由该球员来持球进攻。">>,<<"Skill_BiaoYanShiKe">>,0,4,0,0,0,0,0,100};
get_data(4018) -> {skillInfo,4018,4018,<<"冰人">>,<<"若抢断对方，则冻结被抢断的球员。持续到敌方队伍的下一次进攻结束。">>,<<"Skill_BingRen">>,0,4,0,0,0,0,0,0};
get_data(4019) -> {skillInfo,4019,4019,<<"冰人的领域">>,<<"每有一个受到“冻结”状态的球员，增加自身外线进攻属性100%。">>,<<"Skill_BingRenDeLingYu">>,0,4,0,0,0,0,0,0};
get_data(4020) -> {skillInfo,4020,4020,<<"绝对零度">>,<<"激励：终止对方所有激活的激励效果。对方团队能量无法增长。">>,<<"Skill_JueDuiLingDu">>,0,4,0,0,0,0,0,100};
get_data(4021) -> {skillInfo,4021,4021,<<"不败的神射手">>,<<"投进三分球增加自身30%的HP。">>,<<"Skill_BuBaiDeShenSheShou">>,0,4,0,0,0,0,0,0};
get_data(4022) -> {skillInfo,4022,4022,<<"晨间占卜">>,<<"当HP为满时，自身的外线攻击及技巧属性提升100%。">>,<<"Skill_ChenJianZhanBu">>,0,4,0,0,0,0,0,0};
get_data(4023) -> {skillInfo,4023,4023,<<"吉祥物">>,<<"激励：为己方所有队员增加等同于你外线攻击属性50%的全属性。">>,<<"Skill_JiXiangWu">>,0,4,0,0,0,0,0,100};
get_data(4024) -> {skillInfo,4024,4024,<<"心理战">>,<<"比赛开始时，减少一个对手的HP，效果基于双方等级，最少20%，最多可达50%。">>,<<"Skill_XinLiZhan">>,0,4,0,0,0,0,0,0};
get_data(4025) -> {skillInfo,4025,4025,<<"封喉之刃">>,<<"自身造成助攻时将额外减少对方所有球员的20点HP。">>,<<"Skill_FengHouZhiRen">>,0,4,0,0,0,0,0,0};
get_data(4026) -> {skillInfo,4026,4026,<<"暗影步">>,<<"激励：再次触发心理战，移除自身所有负面效果。">>,<<"Skill_AnYingBu">>,0,4,0,0,0,0,0,100};
get_data(4027) -> {skillInfo,4027,4027,<<"弱点搜查">>,<<"只要对位球员不发生变化，则每10秒增加一次外线防守属性，直到发生一次抢断为止。">>,<<"Skill_RuoDianSouCha">>,0,4,0,0,0,0,0,0};
get_data(4028) -> {skillInfo,4028,4028,<<"攻守平衡">>,<<"每次助攻球员得分，将强化自身及得分者，持续20秒。">>,<<"Skill_GongShouPingHeng">>,0,4,0,0,0,0,0,0};
get_data(4029) -> {skillInfo,4029,4029,<<"大搜捕">>,<<"激励：己方所有球员回复20%最大HP，同时在激励持续时间内增加外防及内防属性50%。">>,<<"Skill_DaSouBu">>,0,4,0,0,0,0,0,100};
get_data(4030) -> {skillInfo,4030,4030,<<"刺客诡道">>,<<"当自身造成抢断时，立刻使得对方减少40点HP。">>,<<"Skill_CiKeGuiDao">>,0,4,0,0,0,0,0,0};
get_data(4031) -> {skillInfo,4031,4031,<<"战略优势">>,<<"当己方比分领先时，自身获得强化效果。">>,<<"Skill_ZhanLveYouShi">>,0,4,0,0,0,0,0,0};
get_data(4032) -> {skillInfo,4032,4032,<<"冻结">>,<<"当自己得分时，随机冻结对方一个球员，持续20秒。">>,<<"Skill_DongJie">>,0,4,0,0,0,0,0,0};
get_data(4033) -> {skillInfo,4033,4033,<<"挑衅">>,<<"自己得分后做出挑衅动作，随机吸取一个对手20点HP。">>,<<"Skill_TiaoXin">>,0,4,0,0,0,0,0,0};
get_data(4034) -> {skillInfo,4034,4034,<<"鼓舞">>,<<"每20秒增加队伍能量5点。">>,<<"Skill_GuWu">>,0,4,0,0,0,0,0,0};
get_data(4035) -> {skillInfo,4035,4035,<<"终结者">>,<<"扣篮得分将额外降低对方所有球员10点HP。">>,<<"Skill_ZhongJieZhe">>,0,4,0,0,0,0,0,0};


get_data(_Id) -> [].
get_indexs() -> [2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,3000,3002,3004,4000,4001,4002,4003,4004,4005,4006,4007,4008,4009,4010,4011,4012,4013,4014,4015,4016,4017,4018,4019,4020,4021,4022,4023,4024,4025,4026,4027,4028,4029,4030,4031,4032,4033,4034,4035].
