-module(whitePaperInfo).
-export([get_data/1,get_indexs/0]).
get_data(1000) -> {whitePaperInfo,1000,1000,<<"中锋">>,0,<<"0">>,<<"篮下掌控能力最强的位置，以防守为己任担当队中的核心作用，卡位和篮板球非常出色。">>};
get_data(1001) -> {whitePaperInfo,1001,1001,<<"大前锋">>,0,<<"0">>,<<"不论攻击与防守都非常出色，利用盖帽进行防守，以篮框周围为攻击点。盖帽和灌篮都非常出色。">>};
get_data(1002) -> {whitePaperInfo,1002,1002,<<"小前锋">>,0,<<"0">>,<<"内线与外线攻守能力俱佳，活动范围大，带球突破能力卓越，整体能力均衡。">>};
get_data(1003) -> {whitePaperInfo,1003,1003,<<"得分后卫">>,0,<<"0">>,<<"具有超强的外线进攻能力，在被人防守顶住的情况下也可以发挥卓越的得分天赋。">>};
get_data(1004) -> {whitePaperInfo,1004,1004,<<"控球后卫">>,0,<<"0">>,<<"具有最为出色的传球能力，防守方面也极为出色，传球和抢断是看家本领。">>};
get_data(2000) -> {whitePaperInfo,2000,2000,<<"内线锋霸">>,1,<<"0">>,<<"这个风格的球员是内线攻击型球员。此类球员拥有游戏中最强的内线攻击属性，同时内线防御属性及篮板球也不差。副属性上以力量为主。">>};
get_data(2001) -> {whitePaperInfo,2001,2001,<<"篮下守护者">>,1,<<"0">>,<<"这个风格的球员是内线防守型球员。此类球员拥有游戏中最强的内线防御属性。副属性上以力量为主。">>};
get_data(2002) -> {whitePaperInfo,2002,2002,<<"柔性内线">>,1,<<"0">>,<<"这个风格的球员是“双修”型职业。拥有内外线攻击的花式动作，这类球员主要是用来描述手感非常好的能内能外的PF及C。意识和力量是这职业的主要副属性。">>};
get_data(2003) -> {whitePaperInfo,2003,2003,<<"飞翔者">>,1,<<"0">>,<<"这个风格的球员是“双修”型职业。主要用来描述SF及G中擅长突破的那一部分。技巧是这个职业的主要副属性。">>};
get_data(2004) -> {whitePaperInfo,2004,2004,<<"神射手">>,1,<<"0">>,<<"这个风格的球员以投术为主。主要用来描述SF及G中擅长投篮的那一部分。意识和技巧是这个职业的主要副属性。">>};
get_data(2005) -> {whitePaperInfo,2005,2005,<<"球场之狐">>,1,<<"0">>,<<"这个风格的球员擅长使用假动作来欺骗对手，并且擅长以传球来制造队友得分的机会。大部分是PG或者SG。">>};
get_data(3000) -> {whitePaperInfo,3000,3000,<<"HP">>,2,<<"0">>,<<"评价一个球员在球场上的“士气”，当士气到0时候，将获得“衰竭”，减少所有属性及移动速度75%。">>};
get_data(3001) -> {whitePaperInfo,3001,3001,<<"内线进攻">>,2,<<"0">>,<<"描述一个球员在内线区域进攻能力的强弱，影响大部分内线进攻花式动作的效果。">>};
get_data(3002) -> {whitePaperInfo,3002,3002,<<"外线进攻">>,2,<<"0">>,<<"描述一个球员在外线区域进攻能力的强弱，影响大部分外线进攻花式动作的效果。">>};
get_data(3003) -> {whitePaperInfo,3003,3003,<<"内线防守">>,2,<<"0">>,<<"与内攻对应，参与花式动作的计算，同时会影响到在内线的防守花式及盖帽的效果。">>};
get_data(3004) -> {whitePaperInfo,3004,3004,<<"外线防守">>,2,<<"0">>,<<"与外攻对应，参与花式动作的计算，同时会影响到在外线的防守花式（主要是抢断）及盖帽的效果。">>};
get_data(3005) -> {whitePaperInfo,3005,3005,<<"篮板球">>,2,<<"0">>,<<"用于进行篮板球的球权争夺时的值，影响篮板花式动作。">>};
get_data(3006) -> {whitePaperInfo,3006,3006,<<"技巧">>,2,<<"0">>,<<"用于一些偏向技巧性的花式动作的加成、防御及特殊效果是否触发的计算。">>};
get_data(3007) -> {whitePaperInfo,3007,3007,<<"力量">>,2,<<"0">>,<<"用于一些偏向力量性的花式动作的加成、防御及特殊效果是否触发的计算。">>};
get_data(3008) -> {whitePaperInfo,3008,3008,<<"意识">>,2,<<"0">>,<<"用于一些偏向团队型合作的花式动作的加成、防御及特殊效果是否触发的计算。">>};
get_data(4000) -> {whitePaperInfo,4000,4000,<<"花式动作">>,3,<<"0">>,<<"花式动作是来决定一个球员将会如何打球的依据。球员将按照街球风格来获得固定的花式动作。">>};
get_data(4001) -> {whitePaperInfo,4001,4001,<<"基础技能">>,3,<<"0">>,<<"球员的基础技能在游戏中随着时间充能，当充能完毕后即可使用并且释放。">>};
get_data(4002) -> {whitePaperInfo,4002,4002,<<"必杀技">>,3,<<"0">>,<<"必杀技是为了突出球员个人风格的存在，也是游戏中的高潮表现部分。必杀技为每个球员个人独有的效果。必杀技的释放需要消耗团队能量。">>};


get_data(_Id) -> [].
get_indexs() -> [1000,1001,1002,1003,1004,2000,2001,2002,2003,2004,2005,3000,3001,3002,3003,3004,3005,3006,3007,3008,4000,4001,4002].
